cmsis-svd/cmsis-svd/data/Atmel/ATSAM4S8B.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SUPC</name>
      <version>6452Z</version>
      <description>Supply Controller</description>
      <groupName>SYSC</groupName>
      <prependToName>SUPC_</prependToName>
      <baseAddress>0x400E1410</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x200</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR</name>
          <description>Supply Controller Control Register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>VROFF</name>
              <description>Voltage Regulator Off</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <description>No effect.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP_VREG</name>
                  <description>If KEY is correct, VROFF asserts the vddcore_nreset and stops the voltage regulator.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XTALSEL</name>
              <description>Crystal Oscillator Select</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <description>No effect.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRYSTAL_SEL</name>
                  <description>If KEY is correct, XTALSEL switches the slow clock on the crystal oscillator output.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>KEY</name>
              <description>Password</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PASSWD</name>
                  <description>Writing any other value in this field aborts the write operation.</description>
                  <value>0xA5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SMMR</name>
          <description>Supply Controller Supply Monitor Mode Register</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SMTH</name>
              <description>Supply Monitor Threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMSMPL</name>
              <description>Supply Monitor Sampling Period</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SMD</name>
                  <description>Supply Monitor disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSM</name>
                  <description>Continuous Supply Monitor</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32SLCK</name>
                  <description>Supply Monitor enabled one SLCK period every 32 SLCK periods</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256SLCK</name>
                  <description>Supply Monitor enabled one SLCK period every 256 SLCK periods</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2048SLCK</name>
                  <description>Supply Monitor enabled one SLCK period every 2,048 SLCK periods</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMRSTEN</name>
              <description>Supply Monitor Reset Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_ENABLE</name>
                  <description>The core reset signal vddcore_nreset is not affected when a supply monitor detection occurs.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>The core reset signal, vddcore_nreset is asserted when a supply monitor detection occurs.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMIEN</name>
              <description>Supply Monitor Interrupt Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_ENABLE</name>
                  <description>The SUPC interrupt signal is not affected when a supply monitor detection occurs.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>The SUPC interrupt signal is asserted when a supply monitor detection occurs.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MR</name>
          <description>Supply Controller Mode Register</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00005A00</resetValue>
          <fields>
            <field>
              <name>BODRSTEN</name>
              <description>Brownout Detector Reset Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_ENABLE</name>
                  <description>The core reset signal vddcore_nreset is not affected when a brownout detection occurs.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>The core reset signal, vddcore_nreset is asserted when a brownout detection occurs.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BODDIS</name>
              <description>Brownout Detector Disable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>The core brownout detector is enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>The core brownout detector is disabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ONREG</name>
              <description>Voltage Regulator Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ONREG_UNUSED</name>
                  <description>Internal voltage regulator is not used (external power supply is used).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONREG_USED</name>
                  <description>Internal voltage regulator is used.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OSCBYPASS</name>
              <description>Oscillator Bypass</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <description>No effect. Clock selection depends on the value of XTALSEL (SUPC_CR).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BYPASS</name>
                  <description>The 32 kHz crystal oscillator is bypassed if XTALSEL (SUPC_CR) is set. OSCBYPASS must be set prior to setting XTALSEL.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>KEY</name>
              <description>Password Key</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PASSWD</name>
                  <description>Writing any other value in this field aborts the write operation.</description>
                  <value>0xA5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WUMR</name>
          <description>Supply Controller Wake-up Mode Register</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SMEN</name>
              <description>Supply Monitor Wake-up Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_ENABLE</name>
                  <description>The supply monitor detection has no wake-up effect.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>The supply monitor detection forces the wake-up of the core power supply.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTTEN</name>
              <description>Real-time Timer Wake-up Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_ENABLE</name>
                  <description>The RTT alarm signal has no wake-up effect.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>The RTT alarm signal forces the wake-up of the core power supply.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTCEN</name>
              <description>Real-time Clock Wake-up Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_ENABLE</name>
                  <description>The RTC alarm signal has no wake-up effect.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>The RTC alarm signal forces the wake-up of the core power supply.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPDBCEN0</name>
              <description>Low-power Debouncer Enable WKUP0</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_ENABLE</name>
                  <description>The WKUP0 input pin is not connected to the low-power debouncer.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>The WKUP0 input pin is connected to the low-power debouncer and forces a system wake-up.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPDBCEN1</name>
              <description>Low-power Debouncer Enable WKUP1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_ENABLE</name>
                  <description>The WKUP1 input pin is not connected to the low-power debouncer.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>The WKUP1 input pin is connected to the low-power debouncer and forces a system wake-up.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPDBCCLR</name>
              <description>Low-power Debouncer Clear</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_ENABLE</name>
                  <description>A low-power debounce event does not create an immediate clear on the first half of GPBR registers.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>A low-power debounce event on WKUP0 or WKUP1 generates an immediate clear on the first half of GPBR registers.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WKUPDBC</name>
              <description>Wake-up Inputs Debouncer Period</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IMMEDIATE</name>
                  <description>Immediate, no debouncing, detected active at least on one Slow Clock edge.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3_SCLK</name>
                  <description>WKUPx shall be in its active state for at least 3 SLCK periods</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32_SCLK</name>
                  <description>WKUPx shall be in its active state for at least 32 SLCK periods</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512_SCLK</name>
                  <description>WKUPx shall be in its active state for at least 512 SLCK periods</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4096_SCLK</name>
                  <description>WKUPx shall be in its active state for at least 4,096 SLCK periods</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32768_SCLK</name>
                  <description>WKUPx shall be in its active state for at least 32,768 SLCK periods</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPDBC</name>
              <description>Low-power Debouncer Period</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable the low-power debouncers.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2_RTCOUT0</name>
                  <description>WKUP0/1 in active state for at least 2 RTCOUTx clock periods</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3_RTCOUT0</name>
                  <description>WKUP0/1 in active state for at least 3 RTCOUTx clock periods</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4_RTCOUT0</name>
                  <description>WKUP0/1 in active state for at least 4 RTCOUTx clock periods</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5_RTCOUT0</name>
                  <description>WKUP0/1 in active state for at least 5 RTCOUTx clock periods</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6_RTCOUT0</name>
                  <description>WKUP0/1 in active state for at least 6 RTCOUTx clock periods</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7_RTCOUT0</name>
                  <description>WKUP0/1 in active state for at least 7 RTCOUTx clock periods</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8_RTCOUT0</name>
                  <description>WKUP0/1 in active state for at least 8 RTCOUTx clock periods</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
